api-definitions/openapi/examples/200PaGetPayment.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:paf="http://pagopa-api.pagopa.gov.it/pa/paForNode.xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <paf:paGetPaymentRes>
         <outcome>OK</outcome>
         <!--Optional:-->
         <data>
            <creditorReferenceId>123456789</creditorReferenceId>
            <paymentAmount>10.00</paymentAmount>
            <dueDate>2019-12-12</dueDate>
            <!--Optional:-->
            <retentionDate>2020-11-11T12:12:11</retentionDate>
            <!--Optional:-->
            <lastPayment>0</lastPayment>
            <description>test</description>
            <!--paymentCategory>test</paymentCategory-->
            <!--Optional:-->
            <companyName>Pa Test</companyName>
            <!--Optional:-->
            <officeName>office</officeName>
            <debtor>
               <uniqueIdentifier>
                  <entityUniqueIdentifierType>G</entityUniqueIdentifierType>
                  <entityUniqueIdentifierValue>77777777777</entityUniqueIdentifierValue>
               </uniqueIdentifier>
               <fullName>name</fullName>
               <!--Optional:-->
               <streetName>street</streetName>
               <!--Optional:-->
               <civicNumber>12</civicNumber>
               <!--Optional:-->
               <postalCode>89020</postalCode>
               <!--Optional:-->
               <city>city</city>
               <!--Optional:-->
               <stateProvinceRegion>IT</stateProvinceRegion>
               <!--Optional:-->
               <country>IT</country>
               <!--Optional:-->
               <e-mail>test.prova@tt.it</e-mail>
            </debtor>
            <transferList>
               <!--1 to 5 repetitions:-->
                <transfer>
                  <idTransfer>1</idTransfer>
                  <transferAmount>10.00</transferAmount>
                  <fiscalCodePA>77777777777</fiscalCodePA>
                  <IBAN>IT45R0760103200000000001016</IBAN>
                  <remittanceInformation>test</remittanceInformation>
                  <transferCategory>test</transferCategory>
               </transfer>
             </transferList>
            <!--Optional:-->
            <metadata>
               <!--1 to 10 repetitions:-->
               <mapEntry>
                  <key>6</key>
                  <value></value>
               </mapEntry>
            </metadata>
         </data>
     </paf:paGetPaymentRes>
   </soapenv:Body>
</soapenv:Envelope>